Revit 2024 API
ConicalSurface.IsValidConeAngle Method
 Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static bool IsValidConeAngle(
	double halfAngle
)
Visual Basic
Public Shared Function IsValidConeAngle ( _
	halfAngle As Double _
) As Boolean
Visual C++
public:
static bool IsValidConeAngle(
	double halfAngle
)
Parameters
halfAngle
Type: System.Double
 Cone half-angle parameter.
Return Value
 True if input is not 0, lesser than PI/2 and greater than -PI/2, false otherwise.
See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace